app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('こんにちは！', 3, 4, '2019-05-11 06:27:58', '2019-05-11 06:27:58')
---
json.(@message, :content, :image)
json.created_at @message.created_at.to_s

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1
---
json.id @message.id
json.group_id @message.group.id