app/views/messages/index.html.haml

SELECT `group_users`.* FROM `group_users` WHERE `group_users`.`group_id` = 1
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 5
---
          %li.member
            - @group.group_users.each do |group_user|