app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (5, 4)

  def create
    @message = @group.messages.new(message_params)
    if @message.save
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'ダウンロード.jpeg', 1, 5, '2019-05-05 04:48:18', '2019-05-05 04:48:18')